# Packet Tracer ব্যবহার

## 📖 Cisco Packet Tracer কী?

**Cisco Packet Tracer** হলো একটি **free network simulation tool** যা দিয়ে real network এর মতো virtual network তৈরি করে practice করা যায়।

```
┌─────────────────────────────────────────────────────────┐
│              Packet Tracer Features                      │
├─────────────────────────────────────────────────────────┤
│                                                          │
│  ✓ Network topology তৈরি (drag & drop)                  │
│  ✓ Routers, Switches, PCs simulate করা                 │
│  ✓ CLI commands practice                                │
│  ✓ Packet flow visualization                            │
│  ✓ Troubleshooting শেখা                                 │
│  ✓ CCNA exam preparation                                │
│  ✓ Free! (Cisco NetAcad account দিয়ে)                  │
│                                                          │
└─────────────────────────────────────────────────────────┘
```

---

## 🔧 Download এবং Installation

### Step 1: Cisco NetAcad Account

```
1. https://www.netacad.com যান
2. Sign up করুন (free)
3. Email verify করুন
4. Resources → Download Packet Tracer
5. আপনার OS অনুযায়ী download করুন
```

### Step 2: Installation

```
Windows:
1. .exe file run করুন
2. Next → Accept → Install
3. Finish

macOS/Linux:
1. Download .dmg বা .deb
2. Install as per your OS
3. Run Packet Tracer
```

---

## 🖥️ Interface Overview

```
┌─────────────────────────────────────────────────────────────────┐
│ File  Edit  Options  View  Tools  Extensions  Help      [_][□][X]│
├─────────────────────────────────────────────────────────────────┤
│ [New][Open][Save]  [Undo][Redo]  [Zoom+][Zoom-]  [Mode: ▼]      │
├────────────┬────────────────────────────────────────────────────┤
│            │                                                     │
│  Device    │              WORKSPACE                              │
│  Panel     │         (Topology তৈরি করুন)                        │
│            │                                                     │
│ ┌────────┐ │                                                     │
│ │Routers │ │                                                     │
│ │Switches│ │                                                     │
│ │End Dev │ │                                                     │
│ │Connect │ │                                                     │
│ └────────┘ │                                                     │
│            │                                                     │
├────────────┴────────────────────────────────────────────────────┤
│ Device-Type Selection Bar                                        │
│ [Router][Switch][Hub][Wireless][Connections][End Devices][More] │
└─────────────────────────────────────────────────────────────────┘
```

---

## 🌐 প্রথম Network তৈরি

### Lab 1: Basic PC to PC Connection

```
Topology:
┌────────┐                           ┌────────┐
│  PC0   │ ══════ Copper Cross ═════ │  PC1   │
│        │        over Cable         │        │
└────────┘                           └────────┘
192.168.1.1                         192.168.1.2

Steps:

1. End Devices → PC → টেনে workspace এ ফেলুন (২টা)

2. Connections → Copper Cross-Over → PC0 click → 
   FastEthernet0 select → PC1 click → FastEthernet0

3. PC0 click → Desktop tab → IP Configuration
   IP: 192.168.1.1
   Subnet: 255.255.255.0

4. PC1 click → Desktop tab → IP Configuration
   IP: 192.168.1.2
   Subnet: 255.255.255.0

5. PC0 → Desktop → Command Prompt
   ping 192.168.1.2
   
   ✓ Reply from 192.168.1.2!
```

---

### Lab 2: Switch দিয়ে Multiple PCs Connect

```
Topology:
                    ┌──────────┐
         ┌──────────│  Switch  │──────────┐
         │          └──────────┘          │
         │               │                │
    ┌────────┐      ┌────────┐      ┌────────┐
    │  PC0   │      │  PC1   │      │  PC2   │
    └────────┘      └────────┘      └────────┘
   192.168.1.10    192.168.1.20    192.168.1.30

Steps:

1. Network Devices → Switches → 2960 → Workspace এ drag

2. End Devices → PC (৩টা add করুন)

3. Connections → Copper Straight-Through
   PC0 FastEthernet → Switch Fa0/1
   PC1 FastEthernet → Switch Fa0/2
   PC2 FastEthernet → Switch Fa0/3

4. প্রতিটি PC তে IP configure করুন
   PC0: 192.168.1.10/24
   PC1: 192.168.1.20/24
   PC2: 192.168.1.30/24

5. যেকোনো PC থেকে অন্যদের ping করুন
```

---

### Lab 3: Router দিয়ে দুই Network Connect

```
Topology:
 Network A (192.168.1.0/24)      Network B (192.168.2.0/24)
      │                                │
  ┌───────┐                        ┌───────┐
  │  PC0  │                        │  PC1  │
  └───┬───┘                        └───┬───┘
      │                                │
  ┌───────┐   ┌──────────┐        ┌───────┐
  │Switch │───│  Router  │────────│Switch │
  └───────┘   │ G0/0 G0/1│        └───────┘
              └──────────┘
         .1 ←─────┴─────→ .1

Steps:

1. Devices add করুন:
   - 1x Router (2911)
   - 2x Switch (2960)
   - 2x PC

2. Connections:
   PC0 → Switch0 (straight)
   Switch0 → Router G0/0 (straight)
   Router G0/1 → Switch1 (straight)
   Switch1 → PC1 (straight)

3. Router Configuration (CLI):
   Router> enable
   Router# configure terminal
   
   Router(config)# interface gigabitEthernet 0/0
   Router(config-if)# ip address 192.168.1.1 255.255.255.0
   Router(config-if)# no shutdown
   Router(config-if)# exit
   
   Router(config)# interface gigabitEthernet 0/1
   Router(config-if)# ip address 192.168.2.1 255.255.255.0
   Router(config-if)# no shutdown
   Router(config-if)# exit

4. PC Configuration:
   PC0: IP 192.168.1.10, Gateway 192.168.1.1
   PC1: IP 192.168.2.10, Gateway 192.168.2.1

5. Test:
   PC0> ping 192.168.2.10
   ✓ Reply!
```

---

## 💻 Router CLI Commands

### Modes

```
Router>                          ← User EXEC Mode (limited)
Router> enable
Router#                          ← Privileged EXEC Mode
Router# configure terminal
Router(config)#                  ← Global Configuration Mode
Router(config)# interface g0/0
Router(config-if)#               ← Interface Configuration Mode
```

### Essential Commands

```
! Show commands (দেখার জন্য)
Router# show ip interface brief       ! সব interface এর summary
Router# show running-config           ! Current config
Router# show ip route                 ! Routing table
Router# show interfaces               ! Detailed interface info
Router# show version                  ! IOS version

! Configuration commands
Router(config)# hostname MyRouter     ! নাম দিন
Router(config)# enable password cisco ! Password সেট
Router(config)# banner motd #Welcome# ! Login banner

! Interface configuration
Router(config)# interface g0/0
Router(config-if)# ip address 192.168.1.1 255.255.255.0
Router(config-if)# no shutdown        ! Interface on করুন
Router(config-if)# description LAN    ! Description

! Save configuration
Router# copy running-config startup-config
Router# write memory
```

---

## 🔀 Switch CLI Commands

```
! Basic commands
Switch> enable
Switch# show mac address-table        ! MAC table দেখুন
Switch# show vlan brief               ! VLANs দেখুন
Switch# show interfaces status        ! Port status

! VLAN Configuration
Switch(config)# vlan 10
Switch(config-vlan)# name Sales
Switch(config-vlan)# exit

! Port এ VLAN assign
Switch(config)# interface fa0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10

! Trunk port (inter-switch)
Switch(config)# interface fa0/24
Switch(config-if)# switchport mode trunk
```

---

## 📡 DHCP Server Configuration

```
Topology:
┌──────────┐     ┌──────────┐     ┌────────┐
│  Router  │─────│  Switch  │─────│  PCs   │
│(DHCP Srv)│     └──────────┘     │(DHCP)  │
└──────────┘                      └────────┘

Router Configuration:

Router(config)# ip dhcp pool LAN
Router(dhcp-config)# network 192.168.1.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.1.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit

Router(config)# ip dhcp excluded-address 192.168.1.1 192.168.1.10

PC Configuration:
Desktop → IP Configuration → DHCP

PC automatically পাবে:
IP: 192.168.1.11 (or next available)
Gateway: 192.168.1.1
DNS: 8.8.8.8
```

---

## 🌐 Static Routing Configuration

```
Topology:
Network A           Router0            Router1           Network B
192.168.1.0/24  ─── G0/0   G0/1 ─── G0/0   G0/1 ─── 192.168.3.0/24
                .1       10.0.0.1  10.0.0.2      .1

Router0 Configuration:
Router0(config)# ip route 192.168.3.0 255.255.255.0 10.0.0.2

Router1 Configuration:
Router1(config)# ip route 192.168.1.0 255.255.255.0 10.0.0.1

Verify:
Router# show ip route
```

---

## 📊 Packet Flow দেখা (Simulation Mode)

```
Simulation Mode ব্যবহার করে packet journey দেখুন:

1. নিচে ডানদিকে "Simulation" click করুন
2. Filters → Edit Filters → শুধু ICMP select করুন
3. একটি PC থেকে ping দিন
4. "Capture / Forward" button দিয়ে step by step দেখুন
5. প্রতিটি device এ packet click করে details দেখুন

OSI Layer Info:
┌─────────────────────────────────────────────┐
│ At PC0:                                      │
│ Layer 3 (Network): ICMP Echo Request         │
│ Source: 192.168.1.10                         │
│ Dest: 192.168.2.10                           │
│                                              │
│ Layer 2 (Data Link): Ethernet Frame          │
│ Src MAC: 0001.4242.1111                      │
│ Dst MAC: 0001.4242.2222 (gateway)            │
└─────────────────────────────────────────────┘
```

---

## 🔐 Basic Security Configuration

### Console Password

```
Router(config)# line console 0
Router(config-line)# password cisco
Router(config-line)# login
Router(config-line)# exit
```

### Telnet/VTY Password

```
Router(config)# line vty 0 4
Router(config-line)# password cisco123
Router(config-line)# login
Router(config-line)# exit
```

### SSH Configuration

```
Router(config)# hostname R1
R1(config)# ip domain-name lab.local
R1(config)# crypto key generate rsa
How many bits? 1024

R1(config)# username admin password adminpass
R1(config)# line vty 0 4
R1(config-line)# transport input ssh
R1(config-line)# login local
```

### Enable Secret (encrypted)

```
Router(config)# enable secret strongpassword
```

---

## 💡 Common Labs to Practice

```
┌─────────────────────────────────────────────────────────┐
│              Recommended Practice Labs                   │
├─────────────────────────────────────────────────────────┤
│                                                          │
│  Beginner:                                              │
│  □ PC to PC with cross-over cable                       │
│  □ Multiple PCs with Switch                             │
│  □ Basic Router setup                                   │
│  □ Two networks with Router                             │
│                                                          │
│  Intermediate:                                          │
│  □ DHCP Server on Router                                │
│  □ Static Routing (2-3 routers)                         │
│  □ VLAN configuration                                   │
│  □ Inter-VLAN routing                                   │
│                                                          │
│  Advanced:                                              │
│  □ OSPF routing                                         │
│  □ NAT/PAT configuration                                │
│  □ ACL (Access Control Lists)                           │
│  □ VPN setup                                            │
│                                                          │
└─────────────────────────────────────────────────────────┘
```

---

## 🛠️ Troubleshooting Tips

### Link Lights

```
Link Status Colors:

● Green (solid)  = Connected, working
● Green (blink)  = Traffic flowing
● Orange         = Starting up / port blocked (STP)
● Red            = Error / not working

If orange stays too long:
- Check cable type (straight vs cross-over)
- Check interface is "no shutdown"
- Check both ends are configured
```

### Common Issues

```
┌─────────────────────────────────────────────────────────┐
│              Common Problems & Solutions                 │
├─────────────────────────────────────────────────────────┤
│                                                          │
│ Problem: Ping fails                                     │
│ Check:                                                  │
│ 1. IP addresses correct?                                │
│ 2. Same subnet?                                         │
│ 3. Gateway configured?                                  │
│ 4. Interface "no shutdown"?                             │
│ 5. Cable type correct?                                  │
│                                                          │
│ Problem: Can't access router CLI                        │
│ Solution: Click Router → CLI tab                        │
│           Press Enter if blank screen                   │
│                                                          │
│ Problem: Config lost after reload                       │
│ Solution: copy run start (save config!)                 │
│                                                          │
└─────────────────────────────────────────────────────────┘
```

---

## ✏️ অনুশীলনী

### ১. Basic Lab
```
তৈরি করুন:
- 4টি PC
- 1টি Switch
- সব PC একই network এ (192.168.10.0/24)
- সবাই সবাইকে ping করতে পারে
```

### ২. Routing Lab
```
তৈরি করুন:
- 2টি Router
- 4টি PC (2+2)
- Network A: 10.0.1.0/24
- Network B: 10.0.2.0/24
- Routers এর মধ্যে: 10.0.0.0/30
- Static routing configure করুন
```

### ৩. DHCP Lab
```
তৈরি করুন:
- 1টি Router (DHCP server হিসেবে)
- 1টি Switch
- 5টি PC (DHCP client)
- PCs automatic IP পাবে
```

---

## 🎓 মনে রাখুন

```
Packet Tracer Essentials:

Cable Types:
- Straight-through: Different devices (PC-Switch)
- Cross-over: Same devices (PC-PC, Switch-Switch)
- Serial: WAN connections (Router-Router)

CLI Tips:
- Tab = auto-complete
- ? = help
- exit = go back one level
- end or Ctrl+Z = go to privileged mode
- copy run start = SAVE!

Practice makes perfect!
```

---

**🔙 [পূর্ববর্তী: Network Commands](./??-?????????-??????.md)** | **🔜 [পরবর্তী: Troubleshooting](./??-???????????.md)**


